# 1.Напишіть функцію яка повертає максимум із 3 чисел


    
#2. Напишіть програму яка друкує тільки парні числа з певного списку




# 3. Напишіть програму яка сумує всі парні числа від 0 до певного числа (х). 
# Для цього створіть функцію яка має х як параметер і викличте цю функцію з числом, яке введе юзер.


# 4. Напишіть програму яка бере список чисел і створює новий список чисел тільки з непарними числами з першого списку


# 5. Напишіть програму, яка отримує на вхід список чисел і виводить найбільше число з цього списку. 
# Наприклад, якщо на вході задано список [1, 4, 7, 2, 9], то на виході повинно бути 9.
