#1. Напишіть програму, яка отримує на вхід список чисел і виводить список тих самих чисел але в зворотньому порядку. 
# Наприклад, якщо на вході задано список [5, 3, 8, 1], то на виході має бути [1, 8, 3, 5].

#2.Напишіть програму, яка отримує на вхід текст і виводить на екран зворотний йому рядок. 
#Наприклад, якщо на вході "hello", то на виході повинно бути "olleh".

#3. Напишіть програму, яка отримує на вхід два списки чисел і виводить спільні елементи між цими двома списками. 
# Наприклад, якщо на вході задано списки [1, 2, 3, 4] і [3, 4, 5, 6], то на виході має бути [3, 4].


#4. Напишіть програму, яка отримує на вхід список слів і виводить кількість унікальних слів у списку.
# Наприклад, якщо вхідний список має вигляд ["apple", "banana", "apple", "cherry", "cherry", "cherry", "cherry"], то на виході повинно бути 3 (є 3 унікальних слова: "apple", "banana" і "cherry").
